Revit 2024 API
HostedSweep.HorizontalFlip Method
Flip the hosted sweep object along horizontal line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void HorizontalFlip()
Visual Basic
Public Sub HorizontalFlip
Visual C++
public:
void HorizontalFlip()
See Also
HostedSweep Class
Autodesk.Revit.DB Namespace